app/views/pets/_form.html.erb

        <%= form.label :species_id, "Espece", class: 'col-md-4 control-label' %>
        <%= form.select :species_id, Species.pluck(:name, :id),{}, class: 'form-control' %>
---
SELECT `species`.`name`, `species`.`id` FROM `species`