app/views/posts/_form.html.erb

SELECT `pets`.`id` FROM `pets` INNER JOIN `pets_posts` ON `pets`.`id` = `pets_posts`.`pet_id` WHERE `pets_posts`.`post_id` = 2
---
    <%= form.label :pet_ids, "Animaux", class: "col-md-4 control-label" %>
    <%= form.select :pet_ids, current_user.pets.pluck(:name, :id), {}, multiple: true, class: "form-control" %>