app/controllers/application_controller.rb

  def current_user
    return nil if !session[:auth] || !session[:auth]['id']
    return @user if @user

    # le find_by_ + champ renvoi nil et donc ne léve pas d'exception comme le .find
    @user = User.find_by_id session[:auth]['id']
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1