app/controllers/passwords_controller.rb

  def create
    user_params = params.require(:user).permit(:email)
    @user = User.find_by_email user_params[:email]
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rere@gmail.com' LIMIT 1

  def update
    user_params = params.require(:user).permit(:password, :password_confirmation, :recover_password)
    @user = User.find params[:id]
    if @user.recover_password == user_params[:recover_password]
      if @user.update user_params
        @user.recover_password = nil
        @user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
UPDATE `users` SET `users`.`password_digest` = '$2a$12$/ojpEVDIG1ZN7opacqHBluiPho5EtEROr03Wvxs4o5VDuKQEI59VW', `users`.`updated_at` = '2024-01-24 22:06:51.909262' WHERE `users`.`id` = 10
UPDATE `users` SET `users`.`password_digest` = '$2a$12$pRPhQSLc9R1STEQUG3SpPuHWdYhkKAc4mvc5HuZuTBfcWO/bHnIIS', `users`.`updated_at` = '2024-01-24 22:04:24.992720' WHERE `users`.`id` = 10

  def edit
    @user = User.find params[:id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1