app/controllers/pets_controller.rb

INSERT INTO `pets` (`name`, `gender`, `birthday`, `user_id`, `species_id`, `created_at`, `updated_at`, `avatar`) VALUES ('rewrwerwe', 'M', '2021-02-04', 10, 1, '2024-02-04 22:07:08.701484', '2024-02-04 22:07:08.701484', TRUE)
---
  def create
    @pet = current_user.pets.new pet_params
    if @pet.save

UPDATE `pets` SET `pets`.`birthday` = '2019-01-28', `pets`.`updated_at` = '2024-01-29 21:44:32.286621' WHERE `pets`.`id` = 1
---
  def update
    if @pet.update pet_params

SELECT `pets`.* FROM `pets` WHERE `pets`.`user_id` = 10 AND `pets`.`id` = 1 LIMIT 1
---
  def set_pet
    @pet = current_user.pets.find(params[:id])