app/controllers/pets_controller.rb

SELECT `pets`.* FROM `pets` WHERE `pets`.`user_id` = 10 AND `pets`.`id` = 1 LIMIT 1
---
  def update
    @pet = current_user.pets.find(params[:id])