app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 10
---
  def index
    @posts = current_user.posts.all

INSERT INTO `pets_posts` (`pet_id`, `post_id`) VALUES (1, 2)
INSERT INTO `posts` (`name`, `content`, `user_id`, `created_at`, `updated_at`) VALUES ('test', 'test', 10, '2024-02-03 20:48:38.637911', '2024-02-03 20:48:38.637911')
---
  def create
    @post = current_user.posts.new(post_params)
    respond_to do |format|
      if @post.save

DELETE FROM `posts` WHERE `posts`.`id` = 1
---
  def destroy
    @post.destroy!

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 10 AND `posts`.`id` = 1 LIMIT 1
---
  def set_post
    @post = current_user.posts.find(params[:id])