app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`confirm` = TRUE AND (`users`.`username` = 'test' OR `users`.`email` = 'test') ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
    params = user_params
    @user = User.where(username: params[:username],
                       confirm: true).or(User.where(email: params[:username],
                                                    confirm: true)).first