app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `confirm`, `confirmation_token`, `password_digest`, `firstname`, `lastname`, `avatar`, `created_at`, `updated_at`, `recover_password`) VALUES ('test', 'test@test.com', FALSE, 'HBRQi1YmUenqjiDcrAedBUFp', '$2a$12$akykPe/TsSKlFDR98F/pgeiOWi/RggFieYQ.jkpjNb6Fn3l2RIIW.', NULL, NULL, FALSE, '2024-05-05 19:55:08.071357', '2024-05-05 19:55:08.071357', NULL)
---
  def create
    @user = User.new user_params

    if @user.save

UPDATE `users` SET `users`.`confirm` = TRUE, `users`.`confirmation_token` = NULL, `users`.`updated_at` = '2024-01-20 20:44:51.795836' WHERE `users`.`id` = 16
---
  def confirm
    # si le parametre token dans l url correspond bien au token dans la db pour ce user
    # ps : on a recup l id avec le before_action qui set le @user
    if @user.confirmation_token == params[:token]
      @user.confirm = true
      @user.confirmation_token = nil
      @user.save validate: false

SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
---
  def edit
    @user = User.find session[:auth]['id']

SELECT `users`.* FROM `users` WHERE `users`.`id` = 16 LIMIT 1
---
  def set_user
    @user = User.find params[:id]