app/controllers/users_controller.rb

UPDATE `users` SET `users`.`firstname` = 'test', `users`.`lastname` = 'test', `users`.`updated_at` = '2024-05-05 19:55:31.397970' WHERE `users`.`id` = 1
---
  def update
    @user = current_user

    if @user.update user_params